IDEA Open Model
RebarHookBend.Radius Property
Compatible with IDEA StatiCa 20.1
 Bending Radius. It will override Vertex Radius in case of RebarArcRadVertex3D and RebarArcRadVertex3D.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarHookBend Class
IdeaRS.OpenModel.Model Namespace